Revit 2024 API
FormulaEditingEventArgs Members
The FormulaEditingEventArgs type exposes the following members.
Methods
Name | Description
Apply
 Applies formula to the parameter
Cancel
 When the event is cancellable, may call the Cancel() method to cancel it.
 (Inherited from RevitAPIPreEventArgs.)
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
CurrentDocument
 Returns the current document
Formula
 Returns text of the formula that will be modified
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
ParameterId
 Returns the Id of the modified parameter
See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace